app/controllers/users_controller.rb

INSERT INTO "users" ("email", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test@example.com"], ["image", "image string"], ["created_at", "2018-02-17 01:30:11.070484"], ["updated_at", "2018-02-17 01:30:11.070484"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "test@example.com"], ["image", "image string"], ["updated_at", "2018-02-17 01:31:02.851440"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)